if (navigator.platform === "New Nintendo 3DS") alert('у меня грустная новость... этот сайт не поддерживает консоли семейства 3DS, но я знаю какой сайт может вам понравится и который поддерживает консоли этого семейства! нажми ок чтобы перейти на тот сайт :D');
if (navigator.platform === "Nintendo 3DS") alert('у меня грустная новость... этот сайт не поддерживает консоли семейства 3DS, но я знаю какой сайт может вам понравится и который поддерживает консоли этого семейства! нажми ок чтобы перейти на тот сайт :D');
window.location.href = "/for3ds/main.html";
